Revit 2020 API
ExternalServices.BuiltInExternalServices.SnappingService Property
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public static ExternalServiceId SnappingService { get; }
Visual Basic
Public Shared ReadOnly Property SnappingService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ SnappingService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace